<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FacultySeeder extends Seeder
{
    protected $faculties = [
        [
            'id' => 'c69e9628-6663-11e9-8107-005056bc52bb',
            'name' => 'Автономная образовательная программа TISP'
        ],
        [
            'id' => 'ad1e953e-27b6-11ee-814f-005056bc52bb',
            'name' => 'Автономная образовательная программа Анализ естественного языка (NLP) в лингвистике и IT'
        ],
        [
            'id' => '5b461cc5-a98c-11e7-813b-005056bc249c',
            'name' => 'Автономная образовательная программа Биофотоника'
        ],
        [
            'id' => 'd4ba0a05-27b5-11ee-814f-005056bc52bb',
            'name' => 'Автономная образовательная программа Дата-аналитика для бизнеса'
        ],
        [
            'id' => '518c4175-56c3-11e9-8104-005056bc52bb',
            'name' => 'Автономная образовательная программа Евразийская интеграция: политика, право, торгово-экономическое взаимодействие'
        ],
        [
            'id' => 'b9f0a260-a98a-11e7-813b-005056bc249c',
            'name' => 'Автономная образовательная программа Изучение Сибири и Арктики'
        ],
        [
            'id' => 'a3ed2d8f-fa73-11e7-8143-005056bc249c',
            'name' => 'Автономная образовательная программа Компьютерная и когнитивная лингвистика'
        ],
        [
            'id' => '2263aa4f-a98c-11e7-813b-005056bc249c',
            'name' => 'Автономная образовательная программа Устойчивое развитие и управление территорией'
        ],
        [
            'id' => '7bf2d745-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Геолого-географический факультет'
        ],
        [
            'id' => '67206686-e921-11e7-8140-005056bc249c',
            'name' => 'Институт биологии,экологии,почвоведения,сельского и лесного хозяйства (Биологический институт)'
        ],
        [
            'id' => '56e0125e-84ec-11e4-be9d-08606ee61ec5',
            'name' => 'Институт искусств и культуры'
        ],
        [
            'id' => 'dbd85d4a-1d96-11eb-8127-005056bc52bb',
            'name' => 'Институт образования ТГУ'
        ],
        [
            'id' => '3d973de1-9bbc-11e7-813b-005056bc249c',
            'name' => 'Институт прикладной математики и компьютерных наук'
        ],
        [
            'id' => '218a3bb4-30ad-11e7-8134-005056bc249c',
            'name' => 'Институт экономики и менеджмента'
        ],
        [
            'id' => 'eaaf54af-84eb-11e4-be9d-08606ee61ec5',
            'name' => 'Механико-математический факультет'
        ],
        [
            'id' => 'aa30cf34-6279-11e9-8107-005056bc52bb',
            'name' => 'Научно-образовательный центр Высшая ИТ школа'
        ],
        [
            'id' => '12ced8b0-ef5c-11eb-8131-005056bc52bb',
            'name' => 'Научно-образовательный центр Межкультурная коммуникация и кроссдисциплинарные исследования'
        ],
        [
            'id' => '7bf2d748-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Радиофизический факультет'
        ],
        [
            'id' => 'e9511b92-d2bd-11e8-80fb-005056bc52bb',
            'name' => 'Факультет довузовской подготовки'
        ],
        [
            'id' => '7bf2d752-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Факультет журналистики'
        ],
        [
            'id' => '61c3dd9b-84ed-11e4-be9d-08606ee61ec5',
            'name' => 'Факультет инновационных технологий'
        ],
        [
            'id' => '7bf2d74e-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Факультет иностранных языков'
        ],
        [
            'id' => '3aec9164-9611-11e8-80f4-005056bc52bb',
            'name' => 'Факультет исторических и политических наук'
        ],
        [
            'id' => '7bf2d74f-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Факультет психологии'
        ],
        [
            'id' => '7bf2d751-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Факультет физической культуры'
        ],
        [
            'id' => 'fcce9b46-174e-11eb-8126-005056bc52bb',
            'name' => 'Физико-математическая школа'
        ],
        [
            'id' => '8f5c99d7-84ec-11e4-be9d-08606ee61ec5',
            'name' => 'Физико-технический факультет'
        ],
        [
            'id' => '0bbf1b29-84ec-11e4-be9d-08606ee61ec5',
            'name' => 'Физический факультет'
        ],
        [
            'id' => '7bf2d74b-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Филологический факультет'
        ],
        [
            'id' => '7bf2d74a-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Философский факультет'
        ],
        [
            'id' => '7bf2d749-9d76-11e4-80ba-001a64c9e034',
            'name' => 'Химический факультет'
        ],
        [
            'id' => '05e109ed-1a83-11e6-8108-005056bc249c',
            'name' => 'Юридический институт'
        ]
    ];

    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        foreach ($this->faculties as $faculty) {
            DB::table('faculties')->insert([
                'id' => $faculty['id'],
                'name' => $faculty['name'],
            ]);
        }
    }
}
